pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BTLE_RF</name>
      <description>Bluetooth LE RF</description>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0x600</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BLE_PART_ID</name>
          <description>BluetoothLE LOW ENERGY PART ID</description>
          <addressOffset>0x600</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_PART_ID</name>
              <description>BluetoothLE Part ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>000</name>
                  <description>Pre-production</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>001</name>
                  <description>Pre-production</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>010</name>
                  <description>KW40</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>011</name>
                  <description>KW41</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>100</name>
                  <description>K3S</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>101</name>
                  <description>KW35/36</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>110</name>
                  <description>KW37/38, K4</description>
                  <value>#110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSM_STATUS</name>
          <description>BluetoothLE DSM STATUS</description>
          <addressOffset>0x604</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFF8</resetMask>
          <fields>
            <field>
              <name>ORF_SYSCLK_REQ</name>
              <description>RF Oscillator Requested</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RIF_LL_ACTIVE</name>
              <description>Link Layer Active</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XCVR_BUSY</name>
              <description>Transceiver Busy Status Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>RF Channel in available (TSM is idle)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>RF Channel in use (TSM is busy)</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTLE_ABORT</name>
              <description>Btle Abort Status Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>BluetoothLE protocol engine has access to the RF channel</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>BluetoothLE protocol engine has relinquish access to the RF channel</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CTRL</name>
          <description>BluetoothLE MISCELLANEOUS CONTROL</description>
          <addressOffset>0x608</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_RELINQUISH</name>
              <description>BluetoothLE Relinquish Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Not force BluetoothLE protocol engine relinquish access to RF channel</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>force BluetoothLE protocol engine relinquish access to RF channel</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSM_INTR_EN</name>
              <description>TSM Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_ABORT_EN</name>
              <description>enable pll_abort/ble_relinquish in rx process</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>enable pll_abort/ble_relinquish in rx process</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>disable pll_abort/ble_relinquish in rx process</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTM_RX_DISABLE</name>
              <description>DTM_RX gating bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>Gate off the DTM_RX</description>
                  <value>#1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0</name>
                  <description>pass through the DTM_RX</description>
                  <value>#0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
