pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>SAM_CTRL</name>
          <description>SAM CONTROL</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80804000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_EN</name>
              <description>Enables SAP0 Partition of the SAM Table</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables SAP0 Partition</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables SAP0 Partition</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA0_EN</name>
              <description>Enables SAA0 Partition of the SAM Table</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables SAA0 Partition</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables SAA0 Partition</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAP1_EN</name>
              <description>Enables SAP1 Partition of the SAM Table</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables SAP1 Partition</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables SAP1 Partition</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA1_EN</name>
              <description>Enables SAA1 Partition of the SAM Table</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disables SAA1 Partition</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enables SAA1 Partition</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAA0_START</name>
              <description>First Index of SAA0 partition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAP1_START</name>
              <description>First Index of SAP1 partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAA1_START</name>
              <description>First Index of SAA1 partition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_TABLE</name>
          <description>SOURCE ADDRESS MANAGEMENT TABLE</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xC00007F</resetMask>
          <fields>
            <field>
              <name>SAM_INDEX</name>
              <description>Contains the SAM table index to be enabled or invalidated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM_INDEX_WR</name>
              <description>Enables SAM Table Contents to be updated</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAM_CHECKSUM</name>
              <description>Software-computed source address checksum, to be installed into a table index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAM_INDEX_INV</name>
              <description>Invalidate the SAM table index selected by SAM_INDEX</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAM_INDEX_EN</name>
              <description>Enable the SAM table index selected by SAM_INDEX</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACK_FRM_PND</name>
              <description>State of AutoTxAck FramePending field when SAM Accelleration is Disabled</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACK_FRM_PND_CTRL</name>
              <description>Manual Control for AutoTxAck FramePending field</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet is determined by hardware</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>the FramePending field of the Frame Control Field of the next automatic TX acknowledge packet tracks ACK_FRM_PEND</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIND_FREE_IDX</name>
              <description>Find First Free Index</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>INVALIDATE_ALL</name>
              <description>Invalidate Entire SAM Table</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SRCADDR</name>
              <description>Source Address Match Status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAM_BUSY</name>
              <description>SAM Table Update Status Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_MATCH</name>
          <description>SOURCE ADDRESS MANAGEMENT MATCH</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SAP0_MATCH</name>
              <description>Index in the SAP0 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP0_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP0 Partition of the SAM Table</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_MATCH</name>
              <description>Index in the SAA0 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAA0 Partition of the SAM Table</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_MATCH</name>
              <description>Index in the SAP1 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP1 Partition of the SAM Table</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_MATCH</name>
              <description>Index in the SAA1 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAP1 Partition of the SAM Table</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_FREE_IDX</name>
          <description>SAM FREE INDEX</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SAP0_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAP0 partition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAA0 partition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAP1 partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAA1 partition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC1</name>
          <description>MISCELLANEOUS(1)</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3FFC0000</resetMask>
          <fields>
            <field>
              <name>SRC_ADDR_CHECKSUM</name>
              <description>Hardware-computed received source address checksum</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_ABORTED</name>
              <description>Autosequence has terminated due to a Software abort.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORTED</name>
              <description>Autosequence has terminated due to an PLL unlock event.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_TX_WU_OVRD</name>
              <description>FAST_TX_WU override</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it when TX in RT or (CCA+TX)</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it at every TX. User should insure channel is not changed since last sequence.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX_WU_OVRD</name>
              <description>FAST_RX_WU override</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it when RX in TR</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it at every RX. User should insure channel is not changed since last sequence.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI</name>
              <description>Poll Indication</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>the received packet was not a data request</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>the received packet was a data request, regardless of whether a Source Address table match occurred, or whether Source Address Management is enabled or not</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FRM_PEND</name>
              <description>RX Frame Pending</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_STS</name>
          <description>SEQUENCE STATUS</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0FFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_START_T1_PEND</name>
              <description>TX T1 Start Pending Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_T2_PEND</name>
              <description>TX T2 Start Pending Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMUP</name>
              <description>TX Warmup Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_PROGRESS</name>
              <description>TX in Progress Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMDN</name>
              <description>TX Warmdown Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T1_PEND</name>
              <description>RX T1 Start Pending Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T1_PEND</name>
              <description>RX T1 Stop Pending Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMUP</name>
              <description>RX Warmup Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_SEARCH</name>
              <description>RX Search Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_PROGRESS</name>
              <description>RX in Progress Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMDN</name>
              <description>RX Warmdown Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_START_T1_PEND</name>
              <description>TR T1 Start Pending Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_START_T2_PEND</name>
              <description>TR T2 Start Pending Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA_START_T1_PEND</name>
              <description>CCA T1 Start Pending Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA_START_T2_PEND</name>
              <description>CCA T2 Start Pending Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQ_T_STATUS</name>
              <description>Status of the just-completed or ongoing Sequence T or Sequence TR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
