pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>LNA_GAIN_VAL_3_0</name>
          <description>LNA_GAIN Step Values 3..0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3809321D</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_VAL_0</name>
              <description>LNA_GAIN step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_1</name>
              <description>LNA_GAIN step 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_2</name>
              <description>LNA_GAIN step 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_3</name>
              <description>LNA_GAIN step 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_VAL_7_4</name>
          <description>LNA_GAIN Step Values 7..4</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8B745D4F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_VAL_4</name>
              <description>LNA_GAIN step 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_5</name>
              <description>LNA_GAIN step 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_6</name>
              <description>LNA_GAIN step 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_7</name>
              <description>LNA_GAIN step 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_VAL_9_8</name>
          <description>LNA_GAIN Step Values 9..8</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xB6A1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_VAL_8</name>
              <description>LNA_GAIN step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_VAL_9</name>
              <description>LNA_GAIN step 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBA_RES_TUNE_VAL_7_0</name>
          <description>BBA Resistor Tune Values 7..0</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_RES_TUNE_VAL_0</name>
              <description>BBA Resistor Tune Step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_1</name>
              <description>BBA Resistor Tune Step 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_2</name>
              <description>BBA Resistor Tune Step 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_3</name>
              <description>BBA Resistor Tune Step 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_4</name>
              <description>BBA Resistor Tune Step 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_5</name>
              <description>BBA Resistor Tune Step 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_6</name>
              <description>BBA Resistor Tune Step 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_7</name>
              <description>BBA Resistor Tune Step 7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBA_RES_TUNE_VAL_10_8</name>
          <description>BBA Resistor Tune Values 10..8</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_RES_TUNE_VAL_8</name>
              <description>BBA Resistor Tune Step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_9</name>
              <description>BBA Resistor Tune Step 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_VAL_10</name>
              <description>BBA Resistor Tune Step 10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_LIN_VAL_2_0</name>
          <description>LNA Linear Gain Values 2..0</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_LIN_VAL_0</name>
              <description>LNA Linear Gain Step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_1</name>
              <description>LNA Linear Gain Step 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_2</name>
              <description>LNA Linear Gain Step 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_LIN_VAL_5_3</name>
          <description>LNA Linear Gain Values 5..3</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_LIN_VAL_3</name>
              <description>LNA Linear Gain Step 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_4</name>
              <description>LNA Linear Gain Step 4</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_5</name>
              <description>LNA Linear Gain Step 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_LIN_VAL_8_6</name>
          <description>LNA Linear Gain Values 8..6</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_LIN_VAL_6</name>
              <description>LNA Linear Gain Step 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_7</name>
              <description>LNA Linear Gain Step 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_LIN_VAL_8</name>
              <description>LNA Linear Gain Step 8</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LNA_GAIN_LIN_VAL_9</name>
          <description>LNA Linear Gain Values 9</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LNA_GAIN_LIN_VAL_9</name>
              <description>LNA Linear Gain Step 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBA_RES_TUNE_LIN_VAL_3_0</name>
          <description>BBA Resistor Tune Values 3..0</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_0</name>
              <description>BBA Resistor Tune Linear Gain Step 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_1</name>
              <description>BBA Resistor Tune Linear Gain Step 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_2</name>
              <description>BBA Resistor Tune Linear Gain Step 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_3</name>
              <description>BBA Resistor Tune Linear Gain Step 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBA_RES_TUNE_LIN_VAL_7_4</name>
          <description>BBA Resistor Tune Values 7..4</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_4</name>
              <description>BBA Resistor Tune Linear Gain Step 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_5</name>
              <description>BBA Resistor Tune Linear Gain Step 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_6</name>
              <description>BBA Resistor Tune Linear Gain Step 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_7</name>
              <description>BBA Resistor Tune Linear Gain Step 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BBA_RES_TUNE_LIN_VAL_10_8</name>
          <description>BBA Resistor Tune Values 10..8</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_8</name>
              <description>BBA Resistor Tune Linear Gain Step 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_9</name>
              <description>BBA Resistor Tune Linear Gain Step 9</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_RES_TUNE_LIN_VAL_10</name>
              <description>BBA Resistor Tune Linear Gain Step 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_03_00</name>
          <description>AGC Gain Tables Step 03..00</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_GAIN_00</name>
              <description>BBA Gain 00</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_00</name>
              <description>LNA Gain 00</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_01</name>
              <description>BBA Gain 01</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_01</name>
              <description>LNA Gain 01</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_02</name>
              <description>BBA Gain 02</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_02</name>
              <description>LNA Gain 02</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_03</name>
              <description>BBA Gain 03</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_03</name>
              <description>LNA Gain 03</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_07_04</name>
          <description>AGC Gain Tables Step 07..04</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_GAIN_04</name>
              <description>BBA Gain 04</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_04</name>
              <description>LNA Gain 04</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_05</name>
              <description>BBA Gain 05</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_05</name>
              <description>LNA Gain 05</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_06</name>
              <description>BBA Gain 06</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_06</name>
              <description>LNA Gain 06</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_07</name>
              <description>BBA Gain 07</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_07</name>
              <description>LNA Gain 07</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_GAIN_TBL_11_08</name>
          <description>AGC Gain Tables Step 11..08</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_GAIN_08</name>
              <description>BBA Gain 08</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_08</name>
              <description>LNA Gain 08</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_09</name>
              <description>BBA Gain 09</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_09</name>
              <description>LNA Gain 09</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_10</name>
              <description>BBA Gain 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_10</name>
              <description>LNA Gain 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_GAIN_11</name>
              <description>BBA Gain 11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_GAIN_11</name>
              <description>LNA Gain 11</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
