pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>DCOC_OFFSET_24</name>
          <description>DCOC Offset</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_25</name>
          <description>DCOC Offset</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_OFFSET_26</name>
          <description>DCOC Offset</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_BBA_OFFSET_I</name>
              <description>DCOC BBA I-channel offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_BBA_OFFSET_Q</name>
              <description>DCOC BBA Q-channel offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_I</name>
              <description>DCOC TZA I-channel offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_OFFSET_Q</name>
              <description>DCOC TZA Q-channel offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_BBA_STEP</name>
          <description>DCOC BBA DAC Step</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BBA_DCOC_STEP_RECIP</name>
              <description>DCOC BBA Reciprocal of Step Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBA_DCOC_STEP</name>
              <description>DCOC BBA Step Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_0</name>
          <description>DCOC TZA DAC Step 0</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_0</name>
              <description>DCOC_TZA_STEP_RCP_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_0</name>
              <description>DCOC_TZA_STEP_GAIN_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_1</name>
          <description>DCOC TZA DAC Step 1</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_1</name>
              <description>DCOC_TZA_STEP_RCP_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_1</name>
              <description>DCOC_TZA_STEP_GAIN_1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_2</name>
          <description>DCOC TZA DAC Step 2</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_2</name>
              <description>DCOC_TZA_STEP_RCP_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_2</name>
              <description>DCOC_TZA_STEP_GAIN_2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_3</name>
          <description>DCOC TZA DAC Step 3</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_3</name>
              <description>DCOC_TZA_STEP_RCP_3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_3</name>
              <description>DCOC_TZA_STEP_GAIN_3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_4</name>
          <description>DCOC TZA DAC Step 4</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_4</name>
              <description>DCOC_TZA_STEP_RCP_4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_4</name>
              <description>DCOC_TZA_STEP_GAIN_4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_5</name>
          <description>DCOC TZA DAC Step 5</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_5</name>
              <description>DCOC_TZA_STEP_RCP_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_5</name>
              <description>DCOC_TZA_STEP_GAIN_5</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_6</name>
          <description>DCOC TZA DAC Step 6</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_6</name>
              <description>DCOC_TZA_STEP_RCP_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_6</name>
              <description>DCOC_TZA_STEP_GAIN_6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_7</name>
          <description>DCOC TZA DAC Step 7</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_7</name>
              <description>DCOC_TZA_STEP_RCP_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_7</name>
              <description>DCOC_TZA_STEP_GAIN_7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_8</name>
          <description>DCOC TZA DAC Step 5</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_8</name>
              <description>DCOC_TZA_STEP_RCP_8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_8</name>
              <description>DCOC_TZA_STEP_GAIN_8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_9</name>
          <description>DCOC TZA DAC Step 9</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_9</name>
              <description>DCOC_TZA_STEP_RCP_9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_9</name>
              <description>DCOC_TZA_STEP_GAIN_9</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_TZA_STEP_10</name>
          <description>DCOC TZA DAC Step 10</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_TZA_STEP_RCP_10</name>
              <description>DCOC_TZA_STEP_RCP_10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_TZA_STEP_GAIN_10</name>
              <description>DCOC_TZA_STEP_GAIN_10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAC_CORR_OVRD</name>
          <description>FRAC CORR Override</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAC_CORR_OVRD_EN</name>
              <description>FRAC CORR Override Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC_CORR_OVRD</name>
              <description>FRAC CORR Override Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFO_EST_OVRD</name>
          <description>CFO Estimate Override</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFO_EST_OVRD_EN</name>
              <description>CFO Estimate Override Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFO_EST_OVRD</name>
              <description>CFO Estimate Override Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_D_CHF_COEF_0</name>
          <description>Receive Demod Channel Filter Coef 0</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_D_CH_FILT_H0</name>
              <description>RX Demod Channel Filter Coefficient 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_D_CHF_COEF_1</name>
          <description>Receive Demod Channel Filter Coef 1</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_D_CH_FILT_H1</name>
              <description>RX Demod Channel Filter Coefficient 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_D_CHF_COEF_2</name>
          <description>Receive Demod Channel Filter Coef 2</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_D_CH_FILT_H2</name>
              <description>RX Demod Channel Filter Coefficient 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_D_CHF_COEF_3</name>
          <description>Receive Demod Channel Filter Coef 3</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_D_CH_FILT_H3</name>
              <description>RX Demod Channel Filter Coefficient 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_D_CHF_COEF_4</name>
          <description>Receive Demod Channel Filter Coef 4</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_D_CH_FILT_H4</name>
              <description>RX Demod Channel Filter Coefficient 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_FAIL_TH</name>
          <description>DCOC Calibration Fail Thresholds</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_BETA_F_TH</name>
              <description>DCOC Calibration Beta Fail Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_ALPHA_F_TH</name>
              <description>DCOC Calibration Alpha Fail Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_PASS_TH</name>
          <description>DCOC Calibration Pass Thresholds</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_BETA_P_TH</name>
              <description>DCOC Calibration Beta Pass Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_CAL_ALPHA_P_TH</name>
              <description>DCOC Calibration Alpha Pass Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCOC_CAL_ALPHA</name>
          <description>DCOC Calibration Alpha</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_CAL_ALPHA_I</name>
              <description>DCOC Calibration I-channel ALPHA constant</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCOC_CAL_ALPHA_Q</name>
              <description>DCOC_CAL_ALPHA_Q</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
