pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>TIMING40</name>
          <description>TSM_TIMING40</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6724FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_EN_RX_HI</name>
              <description>Assertion time setting for DCOC_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_EN_RX_LO</name>
              <description>De-assertion time setting for DCOC_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING41</name>
          <description>TSM_TIMING41</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2524FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCOC_INIT_RX_HI</name>
              <description>Assertion time setting for DCOC_INIT (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCOC_INIT_RX_LO</name>
              <description>De-assertion time setting for DCOC_INIT (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING42</name>
          <description>TSM_TIMING42</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAR_ADC_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for SAR_ADC_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for SAR_ADC_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for SAR_ADC_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_ADC_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for SAR_ADC_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING43</name>
          <description>TSM_TIMING43</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE0_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE0_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_TX_LO</name>
              <description>De-assertion time setting for TSM_SPARE0_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE0_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE0_EN_RX_LO</name>
              <description>De-assertion time setting for TSM_SPARE0_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING44</name>
          <description>TSM_TIMING44</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE1_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE1_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_TX_LO</name>
              <description>De-assertion time setting for TSM_SPARE1_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE1_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE1_EN_RX_LO</name>
              <description>De-assertion time setting for TSM_SPARE1_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING45</name>
          <description>TSM_TIMING45</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE2_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE2_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_TX_LO</name>
              <description>De-assertion time setting for TSM_SPARE2_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE2_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE2_EN_RX_LO</name>
              <description>De-assertion time setting for TSM_SPARE2_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING46</name>
          <description>TSM_TIMING46</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSM_SPARE3_EN_TX_HI</name>
              <description>Assertion time setting for TSM_SPARE3_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_TX_LO</name>
              <description>De-assertion time setting for TSM_SPARE3_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_RX_HI</name>
              <description>Assertion time setting for TSM_SPARE3_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM_SPARE3_EN_RX_LO</name>
              <description>De-assertion time setting for TSM_SPARE3_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING47</name>
          <description>TSM_TIMING47</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO0_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO0_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO0_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO0_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING48</name>
          <description>TSM_TIMING48</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO1_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO1_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO1_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO1_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO1_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING49</name>
          <description>TSM_TIMING49</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO2_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO2_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO2_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO2_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO2_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING50</name>
          <description>TSM_TIMING50</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO3_TRIG_EN_TX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_TX_LO</name>
              <description>De-assertion time setting for GPIO3_TRIG_EN (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_HI</name>
              <description>Assertion time setting for GPIO3_TRIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO3_TRIG_EN_RX_LO</name>
              <description>De-assertion time setting for GPIO3_TRIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING51</name>
          <description>TSM_TIMING51</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6703FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_BIAS_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING52</name>
          <description>TSM_TIMING52</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1504FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_FCAL_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING53</name>
          <description>TSM_TIMING53</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6704FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_LF_PD_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_LF_PD_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING54</name>
          <description>TSM_TIMING54</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1504FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING55</name>
          <description>TSM_TIMING55</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_ADC_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING56</name>
          <description>TSM_TIMING56</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x671EFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_AUXPLL_DIG_BUF_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING57</name>
          <description>TSM_TIMING57</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A03FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXTX_RCCAL_EN_RX_HI</name>
              <description>Assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTX_RCCAL_EN_RX_LO</name>
              <description>De-assertion time setting for RXTX_RCCAL_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
