pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>BALUN_TX</name>
          <description>Balun Tuning Cap Settings in Transmit Mode</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNING_RANGE_0</name>
              <description>Tuning Range 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_1</name>
              <description>Tuning Range 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_2</name>
              <description>Tuning Range 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_3</name>
              <description>Tuning Range 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_4</name>
              <description>Tuning Range 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_5</name>
              <description>Tuning Range 5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_6</name>
              <description>Tuning Range 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_7</name>
              <description>Tuning Range 7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BALUN_RX</name>
          <description>Balun Tuning Cap Settings in Receive Mode</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TUNING_RANGE_0</name>
              <description>Tuning Range 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_1</name>
              <description>Tuning Range 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_2</name>
              <description>Tuning Range 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_3</name>
              <description>Tuning Range 3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_4</name>
              <description>Tuning Range 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_5</name>
              <description>Tuning Range 5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_6</name>
              <description>Tuning Range 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNING_RANGE_7</name>
              <description>Tuning Range 7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX_TX_CFG1_FREQ</name>
          <description>Max Transmit Frequency For TX Configuration 1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAX_TX_CFG1_FREQ</name>
              <description>Maximum Transmit Frequency for Standard TX Settings</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTUNE_CTRL</name>
          <description>PLL Coarse Tune Control</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTUNE_TARGET_MANUAL</name>
              <description>Manual Coarse Tune Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_TARGET_DISABLE</name>
              <description>Disable Coarse Tune Target</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_ADJUST</name>
              <description>Coarse Tune Count Adjustment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_MANUAL</name>
              <description>Manual Coarse Tune Setting</description>
              <bitOffset>20</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CTUNE_DISABLE</name>
              <description>Coarse Tune Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_RATE_OVRD_CTRL1</name>
          <description>PLL Data Rate Override Control</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_CAL_SCALE_CFG1</name>
              <description>HPM Scale Configuration1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_SCALE_CFG1</name>
              <description>LPM Scale Configuration1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_FDB_RES_CAL_CFG1</name>
              <description>HPM FDB RES Calibration Configuration1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_FDB_RES_TX_CFG1</name>
              <description>HPM FDB RES Transmit Configuration1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTUNE_RES</name>
          <description>PLL Coarse Tune Results</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTUNE_SELECTED</name>
              <description>Coarse Tune Setting to VCO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTUNE_BEST_DIFF</name>
              <description>Coarse Tune Absolute Best Difference</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTUNE_FREQ_SELECTED</name>
              <description>Coarse Tune Frequency Selected</description>
              <bitOffset>18</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
