pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>DMD_WAVE0_REG2</name>
          <description>no description available</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 0 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 0 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 0 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE1_REG0</name>
          <description>no description available</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 1 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 1 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 1 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 1 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 1 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE1_REG1</name>
          <description>no description available</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 1 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 1 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 1 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 1 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 1 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE1_REG2</name>
          <description>no description available</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 1 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 1 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 1 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE2_REG0</name>
          <description>no description available</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 2 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 2 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 2 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 2 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 2 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE2_REG1</name>
          <description>no description available</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 2 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 2 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 2 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 2 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 2 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE2_REG2</name>
          <description>no description available</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 2 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 2 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 2 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE3_REG0</name>
          <description>no description available</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 3 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 3 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 3 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 3 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 3 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE3_REG1</name>
          <description>no description available</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 3 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 3 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 3 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 3 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 3 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE3_REG2</name>
          <description>no description available</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 3 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 3 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 3 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE4_REG0</name>
          <description>no description available</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 4 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 4 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 4 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 4 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 4 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE4_REG1</name>
          <description>no description available</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 4 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 4 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 4 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 4 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 4 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE4_REG2</name>
          <description>no description available</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 4 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 4 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 4 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE5_REG0</name>
          <description>no description available</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 5 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 5 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 5 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 5 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 5 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
