pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>DMD_WAVE5_REG1</name>
          <description>no description available</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 5 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 5 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 5 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 5 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 5 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE5_REG2</name>
          <description>no description available</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 5 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 5 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 5 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE6_REG0</name>
          <description>no description available</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 6 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 6 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 6 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 6 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 6 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE6_REG1</name>
          <description>no description available</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 6 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 6 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 6 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 6 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 6 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE6_REG2</name>
          <description>no description available</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 6 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 6 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 6 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG0</name>
          <description>no description available</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL0</name>
              <description>Demodulator waveform 7 sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL1</name>
              <description>Demodulator waveform 7 sample 1 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL2</name>
              <description>Demodulator waveform 7 sample 2 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL3</name>
              <description>Demodulator waveform 7 sample 3 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL4</name>
              <description>Demodulator waveform 7 sample 4 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG1</name>
          <description>no description available</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL5</name>
              <description>Demodulator waveform 7 sample 5 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL6</name>
              <description>Demodulator waveform 7 sample 6 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL7</name>
              <description>Demodulator waveform 7 sample 7 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL8</name>
              <description>Demodulator waveform 7 sample 8 (sfix6en5)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL9</name>
              <description>Demodulator waveform 7 sample 9 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMD_WAVE7_REG2</name>
          <description>no description available</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPL10</name>
              <description>Demodulator waveform 7 sample 10 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL11</name>
              <description>Demodulator waveform 7 sample 11 (sfix6en5)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMPL12</name>
              <description>Demodulator waveform 7 sample 12 (sfix6en5)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
