pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>PACKET_RAM_1655</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1656</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1657</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1658</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1659</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1660</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1661</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1662</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1663</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x19FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1664</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1665</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1666</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1667</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1668</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1669</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1670</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1671</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1672</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1673</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1674</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1675</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1676</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1677</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1678</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1679</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1680</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1681</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1682</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1683</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1684</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1685</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1686</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1687</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1688</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1689</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1690</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1A68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
