pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>PACKET_RAM_2051</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x200C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2052</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2053</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2054</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2055</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x201C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2056</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2057</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2058</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2059</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x202C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2060</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2061</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2062</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2063</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x203C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2064</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2065</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2066</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2067</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x204C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2068</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2069</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2070</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2071</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x205C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2072</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2073</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2074</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2075</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x206C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2076</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2077</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2078</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2079</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x207C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2080</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2081</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2082</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2083</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x208C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2084</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2085</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_2086</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x2098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
