pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
        <register>
          <name>PACKET_RAM_1398</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1399</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1400</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1401</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1402</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1403</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1404</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1405</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1406</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1407</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x15FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1408</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1409</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1410</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1411</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x160C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1412</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1413</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1414</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1415</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x161C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1416</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1417</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1624</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1418</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1628</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1419</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x162C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1420</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1421</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1422</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1423</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x163C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1424</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1425</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1426</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1427</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x164C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1428</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1429</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1654</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1430</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1658</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1431</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x165C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1432</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1660</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKET_RAM_1433</name>
          <description>Shared Packet RAM for multiple Link Layer usage.</description>
          <addressOffset>0x1664</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>RAM</name>
              <description>One entry in the packet RAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
