pyocd/pyOCD/pyocd/debug/svd/data/MKW38A4.svd
                  <description>write: no effect; read: Radio 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Radio 0 interrupt state to pending; read: Radio 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND25</name>
              <description>FlexCAN0 ORed Message Buffer (MB0-31) interrupt interrupt set-pending bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexCAN0 ORed Message Buffer (MB0-31) interrupt interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexCAN0 ORed Message Buffer (MB0-31) interrupt interrupt state to pending; read: FlexCAN0 ORed Message Buffer (MB0-31) interrupt interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND26</name>
              <description>Radio 1 interrupt set-pending bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Radio 1 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Radio 1 interrupt state to pending; read: Radio 1 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND27</name>
              <description>Multipurpose Clock Generator interrupt set-pending bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Multipurpose Clock Generator interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Multipurpose Clock Generator interrupt state to pending; read: Multipurpose Clock Generator interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND28</name>
              <description>Low-Power Timer 0 interrupt set-pending bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low-Power Timer 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Low-Power Timer 0 interrupt state to pending; read: Low-Power Timer 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND29</name>
              <description>Serial Peripheral Interface 1 interrupt set-pending bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Serial Peripheral Interface 1 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Serial Peripheral Interface 1 interrupt state to pending; read: Serial Peripheral Interface 1 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND30</name>
              <description>Pin detect Port A interrupt set-pending bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Pin detect Port A interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Pin detect Port A interrupt state to pending; read: Pin detect Port A interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND31</name>
              <description>Pin detect Port B and C interrupt set-pending bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Pin detect Port B and C interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Pin detect Port B and C interrupt state to pending; read: Pin detect Port B and C interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
